Autodesk.Revit.DB.CurveElementType
An enumerated type listing the curve element types that can be used when filtering elements
(via CurveElementFilter).
Since:
2011

Autodesk.Revit.DB.CurveElementType.Cloud
A portion of a revision cloud.

Autodesk.Revit.DB.CurveElementType.Insulation
A detail curve representing insulation.

Autodesk.Revit.DB.CurveElementType.RepeatingDetail
The profile of a repeating detail set.

Autodesk.Revit.DB.CurveElementType.CurveByPoints
A curve created by connecting a set of points.

Autodesk.Revit.DB.CurveElementType.AreaSeparation
An area separation curve.

Autodesk.Revit.DB.CurveElementType.RoomSeparation
An room separation curve.

Autodesk.Revit.DB.CurveElementType.SpaceSeparation
A space separation curve.

Autodesk.Revit.DB.CurveElementType.ReferenceLine
A reference line.

Autodesk.Revit.DB.CurveElementType.SymbolicCurve
A symbolic curve.

Autodesk.Revit.DB.CurveElementType.DetailCurve
A detail curve.

Autodesk.Revit.DB.CurveElementType.ModelCurve
A model curve.

Autodesk.Revit.DB.CurveElementType.Invalid
An invalid curve element type.